# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8m + A3-FPN object detection model (medium)
# A3-FPN: Asymptotic Content-Aware Pyramid Attention Network

nc: 80
scales:
  m: [0.67, 0.75, 768]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [[4, 6, 9], 1, A3FPN, [256, 3]] # 10
  - [[10, 11, 12], 1, Detect, [nc]] # 11
