# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + A3-FPN object detection model with P3/8 - P5/32 outputs
# A3-FPN: Asymptotic Content-Aware Pyramid Attention Network
# Paper: https://arxiv.org/abs/2604.10210
#
# Usage:
#   from ultralytics import YOLO
#   model = YOLO("yolov8-a3fpn.yaml")  # build from YAML
#   model = YOLO("yolov8n-a3fpn.pt")   # load pretrained (if available)
#
# Note: This model uses A3FPNDetectionModel class which handles
# A3-FPN's multi-scale outputs. The A3FPN layer outputs 3 feature
# maps that are stored at consecutive indices [10, 11, 12].

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone (same as standard v8)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# A3-FPN neck + YOLOv8 head
# The A3FPN layer takes backbone features [P3, P4, P5] and outputs
# 3 fused feature maps. Detect head references A3FPN's index.
head:
  # A3-FPN neck: input from backbone [4,6,9], outputs expanded at [10,11,12]
  - [[4, 6, 9], 1, A3FPN, [256, 3]] # 10
  # Detection head: references A3FPN outputs at [10,11,12]
  - [[10, 11, 12], 1, Detect, [nc]] # 11

