# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + A3-FPN object detection model with P3/8 - P5/32 outputs
# A3-FPN: Asymptotic Content-Aware Pyramid Attention Network
# Paper: https://arxiv.org/abs/2604.10210
#
# Usage:
#   from ultralytics import YOLO
#   model = YOLO("yolo11-a3fpn.yaml")  # build from YAML
#
# Note: This model uses A3FPNDetectionModel class which handles
# A3-FPN's multi-scale outputs. The A3FPN layer outputs 3 feature
# maps that are stored at consecutive indices [11, 12, 13].

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone (same as standard v11)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# A3-FPN neck + YOLO11 head
# The A3FPN layer takes backbone features [P3, P4, P5] and outputs
# 3 fused feature maps. Detect head references A3FPN's index.
head:
  # A3-FPN neck: input from backbone [4,6,10], outputs expanded at [11,12,13]
  - [[4, 6, 10], 1, A3FPN, [256, 3]] # 11
  # Detection head: references A3FPN outputs at [11,12,13]
  - [[11, 12, 13], 1, Detect, [nc]] # 12
